/*Ввести 3 цілі числа перевірити чи існує трикутник із такими довжинами сторін і визначити чи він є прямокутний.*/

#include <iostream>
#include <math.h>
using namespace std;
int main(){
  int a,b,c;
  cout<<"Введть першу довжину трикутника";
  cin>>a;
  cout<<"Введть другу довжину трикутника";
  cin>>b;
  cout<<"Введть третю довжину трикутника";
  cin>>c;
  if(a+b>c && a+c>b && b+c>a){
    cout<<"\n Трикутник зі сторонами"<<a<<" "<<b<<" "<<c<<" існує.";
    if(pow(a,2) + pow(b,2) = pow(c,2) || pow(a,2) + pow(c,2) = pow(b,2) || pow(b,2)+pow(c,2)=pow(a,2))
      cout<<"\n Трикутник прямокутний";
    else cout<<"\n Трикутник не є прямокутним";
  }
  else cout<<"\n Прямокутника із такими сторонами не існує";
  return 0;
}
